import React from "react";
import styles from "./History.module.css";


const History = () => {
  return (
    <div className={styles.main}>
      <div className={styles.container}>
          <div >
              <img className={`${styles.img} img`} src="Images/Shiseikan2.jpg" alt="" />
          </div>

          <div className={styles.contentContainer}>
            {" "}
            {/* New container for background color */}
            <div className={styles.content}>
              <h1 className={styles.header}>История</h1>
              <p className={styles.content_history}>
                Айкидо е сравнително ново бойно изкуство, създадено през 1920г,
                когато неговият създател Морихей Уешиба (О-Сенсей) започва да
                разработва това, което после нарича Айкидо. Ай-ки-до означава
                "пътят (до) към хармония (ай) с ки. Състои се от широк набор от
                техники за задържане и хвърляне , както с голи ръце, така и с
                оръжие. То е ефективна система за самозащита, която се използва
                без колебание в точния момент, на правилното място, с нужната сила
                и с необходимите умения. Принципите на Айкидо се основават върху
                изграждането на здрав и устойчив център /усещане, разбиране и
                енергия в едно/ за адекватно и неагресивно справяне с конфликтна
                ситуация. Айкидо включва техники от традиционни бойни изкуства
                като джу-джуцо и води началото си от японската традиция на войните
                самураи Будо. Будо често се интерпретира като "пътя на меча".
                Въпреки това японският символ за думата е направен от две части,
                едната изобразяваща копие, а другата означаваща "да спра, да не
                използвам" - следователно пътя да спрем (или спрем да използваме)
                меча. Загрижеността за противника в Айкидо е нещо, което го прави
                коренно различно от другите бойни изкуства. Две древни концепции
                на будо са "ай нуке" - "взаимно опазване" и "катсу джин кен" -
                "спасяването на живота на противника". И двете загатват избор,
                действие и отговорност. Айкидо предефинира идеята за "враг" или
                "опонент", като още по дизайн е насочено към контрол вместо
                унищожаване на противника. "Хармонична сила" може да бъде
                интерпретирана като "това което е правилно". Понякога е "айки"
                (правилно) да паднеш или да се провалиш, или да накараш опонента
                да падне или да се провали, но не е "айки" да добавиш наказание
                към действието. Това измества човек от негативния капан на
                отмъстителното мислене. Учи го да има позитивен контрол или
                сдържаност, за благото на всички, в съгласие с това , което е
                правилно. Тези мир и хармония, смекченост и отпуснатост не са
                слабост. Грижата и загрижеността за атакуващия не са просто
                сантименталност, нито намалят ефективността на бойното изкуство.
                Айкидо предлага необикновена комбинация от загриженост и
                ефективност.
              </p>
            </div>
          </div>
      </div>
    </div>
  );
};

export default History;
