import {DetailedMartialArts} from "../Models/martial-arts/DetailedMartialArts";

export const detailedMartialArts: {name: string, data: DetailedMartialArts}[] = [
    {
        name: "aikido",
        data: {
            history: "Айкидо е сравнително ново бойно изкуство, създадено през 1920г,\n" +
                "                когато неговият създател Морихей Уешиба (О-Сенсей) започва да\n" +
                "                разработва това, което после нарича Айкидо. Ай-ки-до означава\n" +
                "                \"пътят (до) към хармония (ай) с ки. Състои се от широк набор от\n" +
                "                техники за задържане и хвърляне , както с голи ръце, така и с\n" +
                "                оръжие. То е ефективна система за самозащита, която се използва\n" +
                "                без колебание в точния момент, на правилното място, с нужната сила\n" +
                "                и с необходимите умения. Принципите на Айкидо се основават върху\n" +
                "                изграждането на здрав и устойчив център /усещане, разбиране и\n" +
                "                енергия в едно/ за адекватно и неагресивно справяне с конфликтна\n" +
                "                ситуация. Айкидо включва техники от традиционни бойни изкуства\n" +
                "                като джу-джуцо и води началото си от японската традиция на войните\n" +
                "                самураи Будо. Будо често се интерпретира като \"пътя на меча\".\n" +
                "                Въпреки това японският символ за думата е направен от две части,\n" +
                "                едната изобразяваща копие, а другата означаваща \"да спра, да не\n" +
                "                използвам\" - следователно пътя да спрем (или спрем да използваме)\n" +
                "                меча. Загрижеността за противника в Айкидо е нещо, което го прави\n" +
                "                коренно различно от другите бойни изкуства. Две древни концепции\n" +
                "                на будо са \"ай нуке\" - \"взаимно опазване\" и \"катсу джин кен\" -\n" +
                "                \"спасяването на живота на противника\". И двете загатват избор,\n" +
                "                действие и отговорност. Айкидо предефинира идеята за \"враг\" или\n" +
                "                \"опонент\", като още по дизайн е насочено към контрол вместо\n" +
                "                унищожаване на противника. \"Хармонична сила\" може да бъде\n" +
                "                интерпретирана като \"това което е правилно\". Понякога е \"айки\"\n" +
                "                (правилно) да паднеш или да се провалиш, или да накараш опонента\n" +
                "                да падне или да се провали, но не е \"айки\" да добавиш наказание\n" +
                "                към действието. Това измества човек от негативния капан на\n" +
                "                отмъстителното мислене. Учи го да има позитивен контрол или\n" +
                "                сдържаност, за благото на всички, в съгласие с това , което е\n" +
                "                правилно. Тези мир и хармония, смекченост и отпуснатост не са\n" +
                "                слабост. Грижата и загрижеността за атакуващия не са просто\n" +
                "                сантименталност, нито намалят ефективността на бойното изкуство.\n" +
                "                Айкидо предлага необикновена комбинация о",
            heading: "Айкидо",
            headImageSrc: "",
            organisations: [
                {
                    name: "Шисейкан Айкидо доджо Варна",
                    city:"Варна",
                    imageSrc: "Images/Shiseikan1.jpg",
                    route:"shiseikan"
                },
            ]
        }
    }
]